package com.bingoabin.cep

//#场景介绍
//在我们的电商系统当中，经常会发现有些订单下单之后没有支付，就会有一个倒计时的时间值，提示你在15分钟之内完成支付，如果没有完成支付，那么该订单就会被取消，主要是因为拍下订单就会减库存，但是如果一直没有支付，那么就会造成库存没有了，别人购买的时候买不到，然后别人一直不支付，就会产生有些人买不到，有些人买到了不付款，最后导致商家一件产品都卖不出去。
//#需求
//创建订单之后15分钟之内一定要付款，否则就取消订单

//#订单数据格式如下类型字段说明
//1.订单编号
//2.订单状态
//    - 1.创建订单,等待支付
//    - 2.支付订单完成
//    - 3.取消订单，申请退款
//    - 4.已发货
//    - 5.确认收货，已经完成
//3.订单创建时间
//4.订单金额
//20160728001511050311389390,1,2016-07-28 00:15:11,295
//20160801000227050311955990,1,2016-07-28 00:16:12,165
//20160728001511050311389390,2,2016-07-28 00:18:11,295
//20160801000227050311955990,2,2016-07-28 00:18:12,165
//20160728001511050311389390,3,2016-07-29 08:06:11,295
//20160801000227050311955990,4,2016-07-29 12:21:12,165
//20160804114043050311618457,1,2016-07-30 00:16:15,132
//20160801000227050311955990,5,2016-07-30 18:13:24,165

//#规则
//出现 1 创建订单标识之后，紧接着需要在15分钟之内出现 2 支付订单操作，中间允许有其他操作
object CEPExample3 {

}
